# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "hashicorp/tap"
tap "universal-ctags/universal-ctags"

# Binaries
brew "ansible"
brew "ansible-lint"
brew "aria2"
brew "awscli"
brew "bat"
brew "checkov"
brew "coreutils"
brew "dnscrypt-proxy", restart_service: true
brew "duf"
brew "dust"
brew "docker-compose"
brew "docker-ls"
brew "dog"
brew "fd"
brew "flake8"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow"
brew "hadolint"
brew "helm"
brew "hexedit"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "lsd"
brew "minikube"
brew "molecule"
brew "mtr"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "openssh"
brew "hashicorp/tap/packer"
brew "pwgen"
brew "pylint"
brew "python@3.9"
brew "radare2"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "telnet"
brew "hashicorp/tap/terraform"
brew "tflint"
brew "tmux"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "vim"
brew "vint"
brew "weechat"
brew "x265"
brew "youtube-dl"

# Applications
cask "alacritty"
cask "alfred"
cask "android-file-transfer"
cask "brave-browser"
cask "cutter"
cask "docker"
cask "drawio"
cask "firefox"
cask "flume"
cask "font-anonymice-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "handbrake"
cask "iina"
cask "istat-menus"
cask "lens"
cask "microsoft-office"
cask "postman"
cask "protonmail-bridge"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "rectangle"
cask "sequel-pro"
cask "signal"
cask "spotify"
cask "sublime-text"
cask "teamviewer"
cask "tunnelblick"
cask "visual-studio-code"
cask "wireguard-tools"
cask "wireshark"
cask "whatsapp"

# Mac App Store
mas "LINE", id: 539883307
mas "AdGuard for Safari", id: 1440147259
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 557168941
mas "Wipr", id: 1320666476
mas "WireGuard", id: 1451685025
